Suupercollidr/Esp32-VE-Direct/src/main.cpp
#include <esp_system.h>
#include <esp_log.h>
#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <time.h>
#include <FS.h>
#include <SD.h>
#include <RTClib.h>
#include <DHTesp.h>
#include <ESP32Ping.h>
#include <InfluxDbClient.h>
#include <InfluxDbCloud.h>
#include "nvs_flash.h"
#include "nvs.h"
#include "configuration.h"
// #include "dev_configuration.h"
#include "mappings.h"

InfluxDBClient influxClient(INFLUXDB_URL, INFLUXDB_ORG, INFLUXDB_DATA_BUCKET, INFLUXDB_TOKEN, InfluxDbCloud2CACert);
InfluxDBClient influxLogClient(INFLUXDB_URL, INFLUXDB_ORG, INFLUXDB_LOG_BUCKET, INFLUXDB_TOKEN, InfluxDbCloud2CACert);
Point sensor("solar_status");

// Define stuff for the NTC
const int nominal_resistance = 10000; // Nominal resistance at 25⁰C
const int nominal_temperature = 25;   // temperature for nominal resistance (almost always 25⁰ C)
const int samplingrate = 5;           // Number of samples
const int beta = 3950;                // The beta coefficient or the B value of the thermistor (usually 3000-4000) check the datasheet for the accurate value.
const int Rref = 9860;                // Value of  resistor used for the voltage divider (measured)
const float measuredOffset = 5.82;    // Measured offset compared to DHT11 sensor

uint32_t lastUpdate = millis();
uint32_t lastTempReading = millis();
uint32_t lastInverterPowerChange = millis();

tm timeinfo;
time_t now;

DHTesp dht;

bool sdInserted;
int inverterOn = 1;

struct greenhouseSensorData
{
    int16_t outdoorTemp;
    int16_t indoorTemp;
    int16_t soilTemp1;
    int16_t soilTemp2;
    uint16_t indoorHumidity;
    uint16_t soilMoisture1;
    uint16_t soilMoisture2;
    uint16_t batteryVoltage;
    uint8_t checksum;
};

std::map<String, int> dataMap; // Map to store data from all sources

void logEvent(const String, const String);
bool logEventToFile(const char *, const String, const String);
bool logEventToInfluxDB(const char *, const String, const String);
uint8_t calculateChecksum(const greenhouseSensorData&);
const char *getResetReason(esp_reset_reason_t);
void storeDataToNvs(const char *, const char *);
String readDataFromNvs(const char *);
bool populateDataMap();
void initSd();
void initWiFi();
bool checkInfluxDbConnection();
void sendToInfluxDB();
void appendDataToFile(const String);
String veDirectGetFromSerial(HardwareSerial &serial);
String veDirectTrimMessage(String);
void veDirectGetData(HardwareSerial &serial, const String &prefix);
bool veDirectCalcChecksum(String);
void veDirectStoreMessage(String, String);
int getNtcTemp(int READ_PIN);
void getTempHumid();
greenhouseSensorData getGreenhouseData();
String convertMessageCode(String label, int code);
// std::vector<int> findCombination(const std::vector<int> &series, int code);
void controlInverterByVoltage();

void setup()
{
  nvs_flash_init();
  String lastEventBeforeReboot = readDataFromNvs("lastState");

  Serial.begin(9600);
  Serial1.begin(19200, SERIAL_8N1, RXD1, TXD1);
  Serial2.begin(19200, SERIAL_8N1, RXD2, TXD2);

  Serial.println("====================");
  Serial.println(" System is starting ");
  Serial.println("====================");

  pinMode(NTC_POWER_PIN, OUTPUT);
  pinMode(NTC1_READ_PIN, INPUT);
  pinMode(RELAY1, OUTPUT);
  pinMode(RELAY2, OUTPUT);
  pinMode(RELAY3, OUTPUT);
  pinMode(SD_DET, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(SD_DET), initSd, CHANGE);

  //  initSd();
  initWiFi();
  timeSync(TIME_ZONE, NTP_SERVER1, NTP_SERVER2, NTP_SERVER3);
  checkInfluxDbConnection();
  dht.setup(DHT_PIN, DHTesp::DHT11);

  esp_reset_reason_t resetReason = esp_reset_reason();

  float setupTime = millis() / 1000;
  logEvent(String("Systemet startat. Uppstarten tog " + String(setupTime) + " s."), "INFO");
  logEvent(String("Senaste återställning: " + String(getResetReason(resetReason)) + " (" + String(resetReason) + ")"), "INFO");
  logEvent(String("Senaste åtgärd: " + lastEventBeforeReboot), "INFO");

  storeDataToNvs("lastState", "Setup end");
}

void loop()
{
  storeDataToNvs("lastState", "Loop");

  if (millis() >= lastUpdate + (UPDATE_INTERVAL * 1000))
  {
    populateDataMap();
    // appendDataToFile(dataFileName);  // Skip writing to file for now, see if that helps uptimes
    controlInverterByVoltage();
    sendToInfluxDB();
    lastUpdate = millis();
  }
  yield();
  delay(10);
}

void initSd() // Initialize SD card
{
  storeDataToNvs("lastState", "initSd");
  sdInserted = (digitalRead(SD_DET) == LOW); // True if SD card is inserted

  if (!sdInserted)
  {
    logEvent("SD card removed", "INFO");
    return;
  }

  logEvent("SD card inserted", "INFO");

  if (!SD.begin())
  {
    logEvent("Couldn't mount SD card");
    return;
  }

  logEvent("SD card mounted", "INFO");
  String cardSizeMessage = "SD card size: " + String(SD.cardSize() / (1024 * 1024)) + "MB";
  logEvent(cardSizeMessage, "INFO");
}

void initWiFi() // Connect to WiFi
{
  storeDataToNvs("lastState", "initWiFi");
  logEvent(String("Connecting to WiFi " + String(ssid)), "INFO");
  WiFi.begin(ssid, password, 6);
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(100);
    yield();
    Serial.print(".");
  }
  Serial.println();
  logEvent(String("Connected to WiFi " + String(ssid)), "INFO");
}

void logEvent(const String messageText, const String messageLevel = "ERROR")
{
  storeDataToNvs("lastState", "logEvent");

  time(&now); // Get current time
  char logTimeStamp[30];
  strftime(logTimeStamp, 30, "%Y-%m-%d\t%H:%M:%S", localtime(&now));

  bool writtenToFile = false;
  bool sentToInfluxDB = false;

  //  writtenToFile = logEventToFile(logTimeStamp, messageText, messageLevel);  // Skip writing logs to file

  if ((WiFi.status() == WL_CONNECTED)) // Send event to InfluxDB, but only if connected
  {
    sentToInfluxDB = logEventToInfluxDB(logTimeStamp, messageText, messageLevel);
  }

  Serial.print(String(logTimeStamp) + "\t" + messageLevel + "\t" + messageText);
  //  Serial.print(writtenToFile ? " (written to logfile, " : " (not written to logfile, ");
  Serial.println(sentToInfluxDB ? " sent to Influx DB)" : " not sent to Influx DB)");
}

bool logEventToFile(const char *logTimeStamp, const String messageText, const String messageLevel = "ERROR")
{
  storeDataToNvs("lastState", "logEventToFile");
  bool saveStatus;
  File logFile = SD.open(logFileName, FILE_WRITE);
  logFile.seek(logFile.size()); // Set file pointer to end of file
  String message = String(logTimeStamp) + "\t" + messageLevel + "\t" + messageText;
  if (logFile)
  {
    logFile.println(message);
    logFile.flush();
    logFile.close();
    return true;
  }
  return false;
}

bool logEventToInfluxDB(const char *logTimeStamp, const String messageText, const String messageLevel = "ERROR")
{
  storeDataToNvs("lastState", "logEventToInfluxDB");
  // Create data point for InfluxDB
  Point logPoint("EventLog");
  logPoint.addTag("level", messageLevel);
  logPoint.addField("message", messageText);
  logPoint.addField("timestamp", logTimeStamp);

  // Send data point to InfluxDB
  const bool influxDbResponse = influxLogClient.writePoint(logPoint); // Send data point to InfluxDB
  if (influxDbResponse)
  {
    return true;
  }
  Serial.println(influxLogClient.getLastErrorMessage());
  return false;
}

uint8_t calculateChecksum(const greenhouseSensorData& data)
{
    const uint8_t* bytes = reinterpret_cast<const uint8_t*>(&data);
    uint8_t sum = 0;
    
