Suupercollidr/Esp32-VE-Direct/src/main.cpp
    // Exclude the checksum field itself from calculation
    for (size_t i = 0; i < sizeof(greenhouseSensorData) - sizeof(data.checksum); ++i) {
        sum ^= bytes[i];
    }
    return sum;
}

const char *getResetReason(esp_reset_reason_t reason)
{
  storeDataToNvs("lastState", "getResetReason");
  switch (reason)
  {
  case ESP_RST_UNKNOWN:
    return "Unknown";
  case ESP_RST_POWERON:
    return "Power on";
  case ESP_RST_EXT:
    return "External reset";
  case ESP_RST_SW:
    return "Software reset";
  case ESP_RST_PANIC:
    return "Software panic";
  case ESP_RST_INT_WDT:
    return "Interrupt watchdog";
  case ESP_RST_TASK_WDT:
    return "Task watchdog";
  case ESP_RST_WDT:
    return "Other watchdogs";
  case ESP_RST_DEEPSLEEP:
    return "Deep sleep";
  case ESP_RST_BROWNOUT:
    return "Brownout";
  case ESP_RST_SDIO:
    return "SDIO";
  default:
    return "Not a valid reset reason";
  }
}

void storeDataToNvs(const char *key, const char *value)
{
  if (!debugModeEnabled) return;
  nvs_handle_t stateLoggingHandle;
  esp_err_t err = nvs_open("storage", NVS_READWRITE, &stateLoggingHandle);
  if (err == ESP_OK)
  {
    nvs_set_str(stateLoggingHandle, key, value);
    nvs_commit(stateLoggingHandle);
    nvs_close(stateLoggingHandle);
  }
}

String readDataFromNvs(const char *key)
{
  nvs_handle_t stateLoggingHandle;
  char value[100];
  size_t required_size;
  esp_err_t err = nvs_open("storage", NVS_READONLY, &stateLoggingHandle);
  if (err == ESP_OK)
  {
    nvs_get_str(stateLoggingHandle, key, NULL, &required_size);
    nvs_get_str(stateLoggingHandle, key, value, &required_size);
    nvs_close(stateLoggingHandle);
  }
  return String(value);
}

bool checkInfluxDbConnection()
{
  storeDataToNvs("lastState", "checkInfluxDbConnection");
  if (influxClient.validateConnection())
  {
    logEvent(String("Ansluten till Influx DB: " + influxClient.getServerUrl()), "INFO");
    return true;
  }
  else
  {
    logEvent(String("Kunde inte ansluta till Influx DB: " + influxClient.getLastErrorMessage()));
    return false;
  }
}

void sendToInfluxDB()
{
  storeDataToNvs("lastState", "sendToInfluxDB");
  Point dataPoint("SolarPower");

  for (auto const &entry : dataMap) // Go through all values in dataMap
  {
    String label = entry.first;
    float value = entry.second;

    if (labelMapping.count(label) > 0) // Only send values if they exist in 'labelMapping'
    {
      String name = labelMapping.at(label).displayName;
      int conversionFactor = labelMapping.at(label).conversionFactor;
      int intValue = round(value);
      String humanReadableMsg = "";
      switch (conversionFactor) // Check if we need to convert values
      {
      case 0:
        //  0: Status. Send both int and human-readable message
        humanReadableMsg = convertMessageCode(label, value);
        dataPoint.addField(name, humanReadableMsg); // Add human-readable message as a separate field
        dataPoint.addField(label, intValue);        // Send original value as int (no float for error codes)
        break;

      default:
        // >0: Divide by conversion factor to get reasonable unit (for example, convert mV to V)
        value /= conversionFactor; // Convert integerized value to sensible float value (like mV to V)
        dataPoint.addField(label, value);
        break;
      }
    }
    yield();
  }

  const bool influxDbResponse = influxClient.writePoint(dataPoint); // Send data point to InfluxDB
  Serial.print("Sending to InfluxDB");
  if (!influxDbResponse)
  {
    Serial.println(" failed.");
    logEvent(influxClient.getLastErrorMessage());
    return;
  }
  Serial.println(" sucessful.");
}

void appendDataToFile(const String fileName)
{
  storeDataToNvs("lastState", "appendDataToFile");
  if (!SD.exists("/") || !sdInserted)
  {
    logEvent("Can't write data to file because SD card is not available");
    return;
  }
  bool headers = false;
  if (!SD.exists(fileName)) // If new file, we must add headers
  {
    headers = true;
    logEvent("Creating new datafile", "INFO");
  }
  File dataFile = SD.open(fileName, FILE_WRITE);
  if (!dataFile)
  {
    logEvent("Couldn't open data file");
  }

  if (headers) // If new file, add headers
  {
    for (const auto &entry : labelMapping)
    { // Loop through list of labels and add the display name to the file
      dataFile.print(entry.second.displayName);
      dataFile.print(";");
      yield();
    }
    dataFile.println(); // Add linebreak after headers
  }

  dataFile.seek(dataFile.size()); // Set file pointer to end of file
  for (const auto &entry : labelMapping)
  {
    if (dataMap.count(entry.first) > 0) // Only print value if exist in dataMap (prevents creating empty value)
    {
      dataFile.print(dataMap[entry.first]);
    }
    dataFile.print(";");
    yield();
  }
  dataFile.println(); // Add linebreak after complete row
  Serial.println("Wrote one line of data to file.");
  dataFile.close();
  delay(10); // Just give the file time to be saved before we get up to any other shenannigans
}

bool populateDataMap()
{
  storeDataToNvs("lastState", "populateDataMap");
  dataMap.clear(); // Reset data map

  time(&now); // Get current time
  char currentDate[11];
  char currentTime[9];
  strftime(currentDate, 11, "%Y-%m-%d", localtime(&now));
  strftime(currentTime, 9, "%H:%M:%S", localtime(&now));
  struct tm *timeinfo = localtime(&now);
  int currentHour = timeinfo->tm_hour;
  dataMap["TIMESTAMP"] = now;

  dataMap["ESP_UPTIME"] = millis();
  dataMap["ESP_MEM_FREE"] = ESP.getFreeHeap();
  dataMap["ESP_MEM_LOWEST"] = ESP.getMinFreeHeap();
  dataMap["ESP_PSRAM_FREE"] = ESP.getFreePsram();
  dataMap["ESP_PSRAM_LOWEST"] = ESP.getFreePsram();
  dataMap["CTRL_INV_ON"] = inverterOn;

  veDirectGetData(Serial1, "INV"); // Get message from Phoenix inverter

  yield();
  veDirectGetData(Serial2, "MPPT"); // Get message from SmartSolar MPPT
  yield();
  getTempHumid(); // Get temperature and humidity from DHT and NTC sensors
  yield();

  return true;
}

void veDirectGetData(HardwareSerial &serial, const String &prefix = "")
{
  storeDataToNvs("lastState", "veDirectGetData");
  String message;
  message = veDirectGetFromSerial(serial); // Get what's in the serial buffer
  message = veDirectTrimMessage(message);  // Make sure message contains exactly one message block
  if (!veDirectCalcChecksum(message))      // Verify checksum
  {
    String eventLogMessage = String("Checksum didn't match\r\nMessage block: \r\n" + message);
    logEvent(eventLogMessage);
    return;
  }
  veDirectStoreMessage(message, prefix); // Put values into the 'dataMap' variable
}

String veDirectGetFromSerial(HardwareSerial &serial)
{
  storeDataToNvs("lastState", "veDirectStoreMessage");
  String message;
  while (serial.available() > 0)
  {
    char c = serial.read();
    message += c;
    yield();
  }
  return message;
}

String veDirectTrimMessage(String message)
{
  storeDataToNvs("lastState", "veDirectTrimMessage");
  int startOfLastBlock = message.lastIndexOf("\r\nPID");                                   // The latest message is the last occurance of 'PID' in the string
  int endOfLastBlock = message.lastIndexOf("Checksum") + 10;                               // 10 = number of chars in 'Checksum' + tab + field value
  if (startOfLastBlock == -1 || endOfLastBlock == -1 || startOfLastBlock > endOfLastBlock) // If we can't find 'PID' or 'Checksum', or if message ends before it begins, something went wrong
  {
    String eventLogMessage = String("Serial block missing either \"PID\" or \"Checksum\"\r\nMessage block: \r\n" + message);
    logEvent(eventLogMessage);
    return "";
  }
  message = message.substring(startOfLastBlock, endOfLastBlock);
  yield();
  return message;
}

