Suupercollidr/Esp32-VE-Direct/src/main.cpp
bool veDirectCalcChecksum(String message)
{
  storeDataToNvs("lastState", "veDirectCalcChecksum");
  int checksum = 0;
  for (char c : message)
  {
    checksum = (checksum + int(c)) & 256;
  }
  if (checksum != 0)
  {
    return false;
  }
  return true;
}

void veDirectStoreMessage(String message, String prefix)
{
  storeDataToNvs("lastState", "veDirectStoreMessage");
  String fieldLabel;
  String fieldValue;
  bool isFieldValue = false; // Decides if we read field label or field value
  for (char c : message)
  {
    switch (c)
    {
    case 0x0D:               // Carriage return means end of field. Finalize and save to dataMap.
      if (!prefix.isEmpty()) // If a prefix was sent to this function, add it to the field label
      {
        fieldLabel = "VE_" + prefix + "_" + fieldLabel;
      }
      dataMap[fieldLabel] = fieldValue.toInt(); // Save what we've got
      fieldLabel.clear();                       // Reset variables
      fieldValue.clear();
      isFieldValue = false; // Next char will be label
      break;

    case 0x0A: // Line feed. Ignore, because we finalized the field after carriage return
      break;

    case 0x09: // Tab, means end of label, start of value
      isFieldValue = true;
      break;

    default:            // Actual data
      if (isFieldValue) // Add character to value or label
      {
        fieldValue += c;
      }
      else
      {
        fieldLabel += c;
      }
      break;
    }
    yield();
  }
}

void getTempHumid() // Collect temperature and humidity and save to 'dataMap'
{
  storeDataToNvs("lastState", "getTempHumid");
  int dhtDelay = dht.getMinimumSamplingPeriod() - (millis() - lastTempReading);
  if (dhtDelay > 0) // Make sure it's been at least MinimumSamplingPeriod since last measurement
  {
    logEvent("Waiting for DHT sensor to calm down.", "INFO");
    delay(dhtDelay);
  }

  float humidity = dht.getHumidity();
  Serial.print("DHT humidity: ");
  Serial.println(humidity);
  if (humidity < 300) // Ignore coco-bananas values
  {
    dataMap["ENV_ROOM_HUMID"] = humidity;
  }
  else
  {
    logEvent("Ignored unreasonable humidity value from DHT sensor", "WARNING");
  }

  float dhtTemperature = dht.getTemperature();
  Serial.print("DHT temperature: ");
  Serial.println(dhtTemperature);
  if (dhtTemperature < 300)
  {
    dataMap["ENV_ROOM_TEMP"] = dhtTemperature;
  }
  else
  {
    logEvent("Ignored unreasonable temperature value from DHT sensor", "WARNING");
  }

  int ntcTemperature = getNtcTemp(NTC1_READ_PIN);
  Serial.print("NTC temperature 1: ");
  Serial.println(ntcTemperature);
  if (ntcTemperature > -200)
  {
    dataMap["ENV_REFRIG_TEMP"] = ntcTemperature;
  }
  else
  {
    logEvent("Ignored unreasonable temperature value from NTC 1", "WARNING");
  }
  lastTempReading = millis();

  ntcTemperature = getNtcTemp(NTC2_READ_PIN);
  Serial.print("NTC temperature 2: ");
  Serial.println(ntcTemperature);
  if (ntcTemperature > -200)
  {
    dataMap["ENV_FREEZER_TEMP"] = ntcTemperature;
  }
  else
  {
    logEvent("Ignored unreasonable temperature value from NTC 2", "WARNING");
  }
  lastTempReading = millis();
}

int getNtcTemp(int READ_PIN = NTC1_READ_PIN) // Get temperature from NTC sensor
{
  storeDataToNvs("lastState", "getNtcTemp");
  int samples = 0;
  digitalWrite(NTC_POWER_PIN, HIGH);         // Turn voltage on
  for (uint8_t i = 0; i < samplingrate; i++) // Sum 'samplingrate' numbers of voltage samples
  {
    delay(10);
    samples += analogRead(READ_PIN);
  }
  digitalWrite(NTC_POWER_PIN, LOW); // Turn voltage off

  // Calculate average ADC value
  float average = 0;
  average = samples / samplingrate;

  // Calculate NTC resistance
  average = (4095 / average) - 1.0;
  average = Rref / average;

  // Have Steinhart calculate the temperature for us
  float temperature;
  temperature = average / nominal_resistance;
  temperature = log(temperature);
  temperature /= beta;
  temperature += 1.0 / (nominal_temperature + 273.15);
  temperature = 1.0 / temperature;
  temperature -= 273.15;            // convert from K to C
  temperature -= measuredOffset;    // adjust for known offset (at 23°C)
  temperature = round(temperature); // Round to int, sensor not that exact anyway
  return temperature;
}


void controlInverterByVoltage()
{
  const int voltage = dataMap["VE_MPPT_V"];  // Battery voltage in mV. Using MPPT voltage, since Inv. voltage = 0 when off

  // If state changed more recent than retry period, do nothing
  if (millis() - lastInverterPowerChange < (INV_RETRY_PERIOD * 1000))
  {
    return;
  }

  // Do nothing on coco-bananas values
  if (voltage < 1000 || voltage > 20000)
  {
    String messageText = "Orealistikt spänningsvärde (" + String(voltage) + " V), ändrar inte status på inverter";
    logEvent(messageText, "WARNING");
    return;
  }

  // If battery voltage is lower then off voltage, turn inverter off
  if (voltage < INV_OFF_VOLTAGE)
  {
    digitalWrite(RELAY1, HIGH); // Relay is NC
    lastInverterPowerChange = millis();
    inverterOn = 0;
    logEvent("Inverter stängdes av, låg batterispänning", "INFO");
    return;
  }

  // If battery voltage is higher than on voltage, turn inverter on
  if (voltage > INV_ON_VOLTAGE)
  {
    digitalWrite(RELAY1, LOW); // Relay is NC
    lastInverterPowerChange = millis();
    inverterOn = 1;
    logEvent("Inverter slogs på, tillräcklig batterispänning ", "INFO");
    return;
  }
}

String convertMessageCode(String label, int ReceivedCode) // Recieves a label representing message type and a code representing one or more messages
{
  storeDataToNvs("lastState", "convertMessageCode");
  try
  {
    const std::map<const int, const String> &CodeToMessageMappings = LabelCodeMapping.at(label); // Get the code-to-message mapping for this 'label'
    String ConcatenatedMessage;

    if (CodeToMessageMappings.count(ReceivedCode) > 0) // If the message code is an exact match, there is only one message and we can return that
    {
      ConcatenatedMessage = CodeToMessageMappings.at(ReceivedCode);
      return ConcatenatedMessage;
    }

    // Workaround that ignores the hassle of looking for combinations (because it always crashes)
    String messageForCobinedMessage = "No match for " + String(ReceivedCode) + ". Might be a combination message.";
    return (messageForCobinedMessage);

