Suupercollidr/Esp32-VE-Direct/src/main.cpp
    /*
        // If no exact match, extract individual messages using maths

        // Gather all codes for this label
        std::vector<int> AvailableCodes;
        for (const auto &entry : CodeToMessageMappings)
        {
          AvailableCodes.push_back(entry.first);
        }

        // Get a vector of all codes that are summed to make up 'RecievedCode'
        std::vector<int> CodesInMessage = findCombination(AvailableCodes, ReceivedCode);

        if (CodesInMessage.empty())
        {
          throw std::logic_error("Code recieved from VE.Direct doesn't exactly match message table");
        }

        for (int ThisCode : CodesInMessage)
        {
          if (ConcatenatedMessage != "") // If this is not the first message, add comma and space before
          {
            ConcatenatedMessage += ", ";
          }
          ConcatenatedMessage += CodeToMessageMappings.at(ThisCode);
          yield();
        }
        return ConcatenatedMessage;*/
  }
  catch (const std::out_of_range &e) // There is no entry for this label in 'LabelCodeMapping'
  {
    String ErrorMessage = "Hittade inga meddelanden för " + label;
    logEvent(ErrorMessage);
    logEvent(e.what());
    return ErrorMessage;
  }
  catch (const std::runtime_error &e) // There is an entry, but it is empty
  {
    String ErrorMessage = "Hittade inget meddelanden för kod " + String(ReceivedCode) + " för " + label;
    logEvent(ErrorMessage);
    logEvent(e.what());
    return ErrorMessage;
  }
  catch (const std::logic_error &e) // Extracted a code that doesn't have an entry
  {
    String ErrorMessage = "Felaktig meddelandekod " + String(ReceivedCode) + " för " + label;
    logEvent(ErrorMessage);
    logEvent(e.what());
    return ErrorMessage;
  }
}

/*
// Function to find the combination of numbers from the series that sum up to the given code
std::vector<int> findCombination(const std::vector<int> &series, int code)
{
  storeDataToNvs("lastState", "findCombination");
  int32_t startTime = millis();
  int timeOut = 2 * 1000;

  try
  {
    // Get the size of the series
    int seriesSize = series.size();

    // Initialize a 2D array to store the dynamic programming table
    std::vector<std::vector<bool>> dp(seriesSize + 1, std::vector<bool>(code + 1, false));

    storeDataToNvs("lastState", "findCombination, about to init first column in table");

    // Initialize the first column of the table
    for (int i = 0; i <= seriesSize; i++)
    {
      dp[i][0] = true;
      // Timeout guard
      yield();
      if (millis() - startTime > timeOut)
      {
        throw std::runtime_error("Timeout");
      }
    }

    storeDataToNvs("lastState", "findCombination, about to fill dynamic programming table");

    // Fill the dynamic programming table
    for (int i = 1; i <= seriesSize; i++)
    {
      for (int j = 1; j <= code; j++)
      {
        // If the current element is greater than the sum, it cannot be included
        if (series[i - 1] > j)
        {
          dp[i][j] = dp[i - 1][j];
        }
        // Otherwise, consider including or excluding the current element
        else
        {
          dp[i][j] = dp[i - 1][j] || dp[i - 1][j - series[i - 1]];
        }

        // Timeout guard
        yield();
        if (millis() - startTime > timeOut)
        {
          throw std::runtime_error("Timeout");
        }
      }
    }

    // Check if there is a valid combination for the given code
    if (!dp[seriesSize][code])
    {
      // No valid combination found, return an empty vector
      return std::vector<int>();
    }

    // Reconstruct the combination from the dynamic programming table
    std::vector<int> combination;
    int i = seriesSize;
    int j = code;
    while (i > 0 && j > 0)
    {
      if (dp[i][j] && !dp[i - 1][j])
      {
        // Include the current element in the combination
        combination.push_back(series[i - 1]);
        j -= series[i - 1];
      }
      i--;
      // Timeout guard
      yield();
      if (millis() - startTime > timeOut)
      {
        throw std::runtime_error("Timeout");
      }
    }

    return combination;
  }
  catch (const std::runtime_error)
  {
    String errorMessage = "Timeout when trying to find combination of error messages. Returns empty vector. ";
    logEvent(errorMessage, "WARNING");
    return std::vector<int>();
  }
  catch (const std::exception)
  {
    String errorMessage = "Unhandled error when trying to find combination of error messages. Returns empty vector. ";
    logEvent(errorMessage, "WARNING");
    return std::vector<int>();

  }
}
*/